"""Создать еще одну переменную равную среднему арифметическому возрасту, и
вывести это значение на экран.
"""
luda = 40
ulia = 25
kristina = 24
sum = luda + ulia + kristina
sr_ar = sum/3
print (sr_ar)