"""Создать три переменные, содержащие возраст трех ваших друзей, в качестве имен переменных
использовать имена друзей, найти сумму и вывести ее на экран."""
luda = 40
ulia = 25
kristina = 24
sum = luda + ulia + kristina
print (sum)