"""Создать переменную содержащую сторону квадрата, создать новый список, в котором будут периметр квадрата,
площадь квадрата и диагональ квадрата."""
s_kvadrat = 4
list = [s_kvadrat * 4, s_kvadrat ** 2, (2**(1/2)) * s_kvadrat]
print (list)