"""Создать список состоящий из отдельных единичных символов, преобразовать список в строку, инвертировать строку и вывести на печать."""
my_list = ["1","0" ,"5", "y", "r"]
my_string = ''.join(my_list)
rev_string=''.join(reversed(my_string))
print ((rev_string))

